In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [3]:
# Persiapan Data Frame

In [5]:
n_rows = 365 * 24
n_cols = 2
cols = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq = 'H')
df

                     col1  col2
2000-01-01 00:00:00    11     6
2000-01-01 01:00:00    17     2
2000-01-01 02:00:00    17    11
2000-01-01 03:00:00     2     8
2000-01-01 04:00:00     4     1
...                   ...   ...
2000-12-30 19:00:00    17     5
2000-12-30 20:00:00    19     2
2000-12-30 21:00:00     4    11
2000-12-30 22:00:00    11    13
2000-12-30 23:00:00     1     9

[8760 rows x 2 columns]

In [ ]:
# Resampling data dengan interval monthly

In [6]:
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7537
2000-02-29  7061
2000-03-31  7163
2000-04-30  7070
2000-05-31  7478
2000-06-30  7388
2000-07-31  7552
2000-08-31  7609
2000-09-30  7190
2000-10-31  7303
2000-11-30  7205
2000-12-31  6979

In [ ]:
# Resampling data dengan interval daily

In [7]:
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   294
2000-01-02   272
2000-01-03   212
2000-01-04   240
2000-01-05   200
...          ...
2000-12-26   242
2000-12-27   199
2000-12-28   231
2000-12-29   205
2000-12-30   202

[365 rows x 1 columns]

In [8]:
# Membentuk Data Frame dari Dictionary

In [9]:
pd.DataFrame({'col1':[1, 2, 3, 4],
              'col2':[5, 6, 7, 8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [10]:
# Membentuk Data Frame dari Numpy Array

In [11]:
n_rows = 5
n_cols = 3

arr = np.random.randint(1, 20, size=(n_rows, n_cols))
arr

array([[15,  1,  1],
       [15,  8, 14],
       [ 8, 10,  1],
       [ 2, 10, 11],
       [13, 19, 11]])

In [12]:
pd.DataFrame(arr, columns=tuple('ABC'))

    A   B   C
0  15   1   1
1  15   8  14
2   8  10   1
3   2  10  11
4  13  19  11

In [13]:
# Membentuk Data Frame dengan memanfaatkan pandas.util.testing

In [16]:
pd.util.testing.makeDataFrame().head()

                   A         B         C         D
xoCGriSJlX -1.612678 -1.131228 -0.312999  0.396483
r58dgi1snK  0.195835  1.255993 -0.473731  1.753715
ERMuYOAKYC  0.016136  1.750461 -0.635177  0.643110
0dI2JNbNyP -0.473368  0.000986  2.712219  1.466635
L2zdJRMkoa -0.745456  1.598852 -0.528692 -1.234829

In [17]:
pd.util.testing.makeMixedDataFrame().head()

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [18]:
pd.util.testing.makeTimeDataFrame().head()

                   A         B         C         D
2000-01-03  1.113185 -0.105915  1.165172  1.674065
2000-01-04 -2.067802  0.972847 -0.101714  0.390355
2000-01-05  1.159684  0.987381  0.137594 -0.928953
2000-01-06 -0.493482 -0.756037  0.284541  0.279798
2000-01-07 -0.825299  2.550769  0.732960 -2.242598

In [20]:
pd.util.testing.makeMissingDataframe().head()

                   A         B         C         D
pB3ZSA4zqk  1.099375       NaN  1.372689 -1.204537
edEaHt1hiz  0.371888  0.506487 -1.727142 -0.505992
nuyQErZdxf -0.621169 -0.667453  0.352605 -0.904899
uyW5UretTo -1.329918 -1.092921 -0.505537  0.443051
Xgw11ntQ9e -0.598296 -1.103943 -2.229886 -1.249116

In [ ]:
# Persiapan Data Frame

In [32]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)
df

   omset  operasional
0     16            6
1     14            4
2      8           11
3      1            1
4     18           10

In [33]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0  1600000        60000
1  1400000        40000
2   800000       110000
3   100000        10000
4  1800000       100000

In [34]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operasional
0 2000-01-01  1600000        60000
1 2000-01-02  1400000        40000
2 2000-01-03   800000       110000
3 2000-01-04   100000        10000
4 2000-01-05  1800000       100000

In [35]:
# Melakukan formatting tampilan Data Frame

In [44]:
formatku = {'tanggal':'{:%d/%m/%y}',
            'operasional':'Rp {:.2f}',
            'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan

In [43]:
type(laporan)

pandas.io.formats.style.Styler

In [45]:
laporan.hide_index()

In [47]:
laporan.set_caption('Data Omset dan Operasional')

In [48]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')

In [49]:
# Persipan Data Frame

In [56]:
d1 = {'col1':[1, 2, 3],
      'col2':[10, 20, 30]}
df1 = pd.DataFrame(d1)
df1

   col1  col2
0     1    10
1     2    20
2     3    30

In [55]:
d2 = {'col1':[4, 5, 6],
      'col2':[40, 50, 60]}
df2 = pd.DataFrame(d2)
df2

   col1  col2
0     4    40
1     5    50
2     6    60

In [ ]:
# Menggabungkan (merge) dua Data Frame secara berdampingan

In [57]:
df = pd.merge(df1, df2, left_index=True, right_index=True)
df

   col1_x  col2_x  col1_y  col2_y
0       1      10       4      40
1       2      20       5      50
2       3      30       6      60